app/controllers/categories_controller.rb

SELECT * FROM `categories` ORDER BY categories.id DESC LIMIT 1
---
  def index
    @categories = Category.all

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
---
  def edit
    @category = Category.find(params[:cid])

INSERT INTO `categories` (`name`, `description`, `created_at`, `updated_at`) VALUES('afsadf', 'asdfasdf', '2010-10-20 14:44:23', '2010-10-20 14:44:23')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
UPDATE `categories` SET `name` = 'cat00', `description` = 'category 00', `updated_at` = '2010-10-21 07:10:41' WHERE `id` = 12
---
  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])

SELECT * FROM `categories` WHERE (`categories`.`id` = 7)
DELETE FROM `categories` WHERE `id` = 7
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy